jmeter/PostRecipe.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.2">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="PostRecipe" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">50</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">100</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="postRecipe" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
  &quot;cook_time_in_min&quot;: 25,&#xd;
    &quot;prep_time_in_min&quot;: 15,&#xd;
    &quot;title&quot;: &quot;Chicken Hyderabadi Dum Masala10&quot;,&#xd;
    &quot;cusine&quot;: &quot;Hyderabadi&quot;,&#xd;
    &quot;servings&quot;: 2,&#xd;
    &quot;ingredients&quot;: [&#xd;
        &quot;2 test&quot;,&#xd;
        &quot;1 test&quot;&#xd;
    ],&#xd;
    &quot;steps&quot;: [&#xd;
        {&#xd;
            &quot;items&quot;: &quot;marinate&quot;,&#xd;
            &quot;position&quot;: 3&#xd;
        },&#xd;
        {&#xd;
            &quot;items&quot;: &quot;test2&quot;,&#xd;
            &quot;position&quot;: 2&#xd;
        },&#xd;
        {&#xd;
            &quot;items&quot;: &quot;test3&quot;,&#xd;
            &quot;position&quot;: 1&#xd;
        }&#xd;
    ],&#xd;
    &quot;nutrition_information&quot;: {&#xd;
        &quot;calories&quot;: 100,&#xd;
        &quot;sodium_in_mg&quot;: 100,&#xd;
        &quot;protein_in_grams&quot;: 53.7,&#xd;
        &quot;cholesterol_in_mg&quot;: 2.3,&#xd;
        &quot;carbohydrates_in_grams&quot;: 53&#xd;
    }&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">prod.bhulku.me</stringProp>
          <stringProp name="HTTPSampler.protocol">https</stringProp>
          <stringProp name="HTTPSampler.path">/v1/recipe</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResultCollector guiclass="TableVisualizer" testclass="ResultCollector" testname="ResultsTable" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
          <AuthManager guiclass="AuthPanel" testclass="AuthManager" testname="HTTP Authorization Manager" enabled="true">
            <collectionProp name="AuthManager.auth_list">
              <elementProp name="" elementType="Authorization">
                <stringProp name="Authorization.url">https://prod.bhulku.me/v1/recipe</stringProp>
                <stringProp name="Authorization.username">User1@gmail.com</stringProp>
                <stringProp name="Authorization.password">User@1234</stringProp>
              </elementProp>
            </collectionProp>
            <boolProp name="AuthManager.controlledByThreadGroup">false</boolProp>
          </AuthManager>
          <hashTree/>
          <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
          <ResultCollector guiclass="GraphVisualizer" testclass="ResultCollector" testname="Graph Results" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
        </hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="postRecipe1" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
  &quot;cook_time_in_min&quot;: 25,&#xd;
    &quot;prep_time_in_min&quot;: 15,&#xd;
    &quot;title&quot;: &quot;Chicken Hyderabadi Dum Masala10&quot;,&#xd;
    &quot;cusine&quot;: &quot;Hyderabadi&quot;,&#xd;
    &quot;servings&quot;: 2,&#xd;
    &quot;ingredients&quot;: [&#xd;
        &quot;2 test&quot;,&#xd;
        &quot;1 test&quot;&#xd;
    ],&#xd;
    &quot;steps&quot;: [&#xd;
        {&#xd;
            &quot;items&quot;: &quot;marinate&quot;,&#xd;
            &quot;position&quot;: 3&#xd;
        },&#xd;
        {&#xd;
            &quot;items&quot;: &quot;test2&quot;,&#xd;
            &quot;position&quot;: 2&#xd;
        },&#xd;
        {&#xd;
            &quot;items&quot;: &quot;test3&quot;,&#xd;
            &quot;position&quot;: 1&#xd;
        }&#xd;
    ],&#xd;
    &quot;nutrition_information&quot;: {&#xd;
        &quot;calories&quot;: 100,&#xd;
        &quot;sodium_in_mg&quot;: 100,&#xd;
        &quot;protein_in_grams&quot;: 53.7,&#xd;
        &quot;cholesterol_in_mg&quot;: 2.3,&#xd;
        &quot;carbohydrates_in_grams&quot;: 53&#xd;
    }&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">prod.ravi-pilla.me</stringProp>
          <stringProp name="HTTPSampler.protocol">https</stringProp>
          <stringProp name="HTTPSampler.path">/v1/recipe</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="ResultsTree1" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
          <ResultCollector guiclass="TableVisualizer" testclass="ResultCollector" testname="ResultsTable1" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
          <ResultCollector guiclass="GraphVisualizer" testclass="ResultCollector" testname="Graph1" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTPHeaderManager1" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
          <AuthManager guiclass="AuthPanel" testclass="AuthManager" testname="HTTPAuthorizationManager1" enabled="true">
            <collectionProp name="AuthManager.auth_list">
              <elementProp name="" elementType="Authorization">
                <stringProp name="Authorization.url">https://prod.ravi-pila.me/v1/recipe</stringProp>
                <stringProp name="Authorization.username">User1@gmail.com</stringProp>
                <stringProp name="Authorization.password">User@1234</stringProp>
              </elementProp>
            </collectionProp>
            <boolProp name="AuthManager.controlledByThreadGroup">false</boolProp>
          </AuthManager>
          <hashTree/>
        </hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="postRecipe2" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
  &quot;cook_time_in_min&quot;: 25,&#xd;
    &quot;prep_time_in_min&quot;: 15,&#xd;
    &quot;title&quot;: &quot;Chicken Hyderabadi Dum Masala10&quot;,&#xd;
    &quot;cusine&quot;: &quot;Hyderabadi&quot;,&#xd;
    &quot;servings&quot;: 2,&#xd;
    &quot;ingredients&quot;: [&#xd;
        &quot;2 test&quot;,&#xd;
        &quot;1 test&quot;&#xd;
    ],&#xd;
    &quot;steps&quot;: [&#xd;
        {&#xd;
            &quot;items&quot;: &quot;marinate&quot;,&#xd;
            &quot;position&quot;: 3&#xd;
        },&#xd;
        {&#xd;
            &quot;items&quot;: &quot;test2&quot;,&#xd;
            &quot;position&quot;: 2&#xd;
        },&#xd;
        {&#xd;
            &quot;items&quot;: &quot;test3&quot;,&#xd;
            &quot;position&quot;: 1&#xd;
        }&#xd;
    ],&#xd;
    &quot;nutrition_information&quot;: {&#xd;
        &quot;calories&quot;: 100,&#xd;
        &quot;sodium_in_mg&quot;: 100,&#xd;
        &quot;protein_in_grams&quot;: 53.7,&#xd;
        &quot;cholesterol_in_mg&quot;: 2.3,&#xd;
        &quot;carbohydrates_in_grams&quot;: 53&#xd;
    }&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">prod.janhavibhalerao.me</stringProp>
          <stringProp name="HTTPSampler.protocol">https</stringProp>
          <stringProp name="HTTPSampler.path">/v1/recipe</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="ResultsTree2" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
          <ResultCollector guiclass="TableVisualizer" testclass="ResultCollector" testname="ResultsTable2" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
          <ResultCollector guiclass="GraphVisualizer" testclass="ResultCollector" testname="Graph2" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTPHeaderManager2" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
          <AuthManager guiclass="AuthPanel" testclass="AuthManager" testname="HTTPAuthorizationManager2" enabled="true">
            <collectionProp name="AuthManager.auth_list">
              <elementProp name="" elementType="Authorization">
                <stringProp name="Authorization.url">https://prod.janhavibhalerao.me/v1/recipe</stringProp>
                <stringProp name="Authorization.username">User1@gmail.com</stringProp>
                <stringProp name="Authorization.password">User@1234</stringProp>
              </elementProp>
            </collectionProp>
            <boolProp name="AuthManager.controlledByThreadGroup">false</boolProp>
          </AuthManager>
          <hashTree/>
        </hashTree>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>
